package ru.profit.teamcenter.import_tp.app.model.repository;

import java.util.Arrays;
import java.util.List;

public class TpContentImpl implements TpContent {
    @Override
    public List<String> getContent(String key) throws Exception {
        String[] content = getContent().split("\n");
        return Arrays.asList(content);
    }

    private String getContent(){
        return  "test\\Атрибут1Значение1,Атрибут1Значение2,Атрибут1Значение3\\Атрибут2Значение1,Атрибут2Значение2\\Атрибут3Значени1,Атрибут3Значение2,Атрибут3Значение3\\Атрибут4Знач,ение\\\\\n" +
                "Ф\\РАБОЧИЙ (НАЛАДЧИК) СОВМЕСТНО С КОНРОЛЕРОМ ОТК ОБЯЗАН ПРОВЕРИТЬ ПЕРВУЮ ДЕТАЛЬ НА КАЖДОЙ ФИНИШНОЙ\\\\\n" +
                "Ф\\ОПЕРАЦИИ С КАЖДОГО СТАНКА ИЗМЕРИТЕЛЬНЫМ ИНСТРУМЕНТОМ ПО ТЕХНОЛОГИИ\\\\\n" +
                "A\\03180\\005\\  \\4211\\СВЕРЛИЛЬНО-ЦЕНТРОВАЛЬНАЯ  20141\\ИБ 009-97,ИБ 214-98\\      \\      \\o\\\\\n" +
                "\\ЦЕНТРОВАЛЬНЫЙ ДВУХСТОРОННИЙ\\12882 ,\\\\\n" +
                "Б\\ \\          \\ХА-6000\\0\\4019 \\0\\04/01 \\1 \\   1\\0 \\     \\ \\   0 \\   0 \\ \\ \\\\\n" +
                "М\\АВТОКАТ Ф78 ТУ 7774-009-27883685-99             \\                            \\   \\    \\    \\      \\       \\\\\n" +
                "O\\  \\005\\a\\O\\9999888  \\ЦЕНТРОВАТЬ ТОРЦЫ ЗАГОТОВКИ С ДВУХ СТОРОН ОДНОВРЕМЕННО В РАЗМЕР А2 ГОСТ \\\\\n" +
                "й\\14034-74,ВЫДЕРЖИВАЯ РАЗМЕР\\\\\n" +
                "o\\94,326.\\\\\n" +
                "S888                                                                                            99990 0\n" +
                "п\\ПРИСПОСОБЛЕНИЕ 24-398\\  \\\\\n" +
                "п\\ГУБКИ 57-3910\\  \\\\\n" +
                "п\\ПИНЦЕТ 250*Ш91-400\\  \\\\\n" +
                "в\\ВТУЛКА РЕГУЛИРУЕМАЯ 51Е-5363*В51-12 (2ШТ)\\\\\n" +
                "в\\ВТУЛКА ф5*В51-7 (2ШТ)\\\\\n" +
                "в\\ПАТРОН 72Е-491*11ВС-10 (2ШТ)\\\\\n" +
                "r\\СВЕРЛО ЦЕНТРОВОЧНОЕ 2317-0104 ГОСТ 14952-75 (2 ШТ)\\ \\  \\  \\      \\\\\n" +
                "м\\ПРОБКА КОНИЧЕСКАЯ 30Е-824\\  \\      \\      \\\\\n" +
                "P\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\\\\n" +
                "A\\03180\\010\\  \\4110\\ТОКАРНАЯ                  20141\\ИБ 003-98,ИБ 011-97\\      \\      \\o\\\\\n" +
                "\\ТОКАРНЫЙ МНОГОРЕЗЦОВЫЙ П/А\\301\\\\\n" +
                "Б\\ \\          \\1720\\0\\4021 \\0\\04/01 \\1 \\   1\\0 \\     \\ \\   0 \\   0 \\ \\ \\\\\n" +
                "O\\  \\010\\0\\O\\01011181 \\ТОЧИТЬ ОДНОВРЕМЕННО 2 КАНАВКИ:ПЕРВУЮ КАНАВКУ ШИРИНОЙ 1,5+0,43 ДО ДИАМЕТРА \\\\\n" +
                "й\\7-0,36,ВЫДЕРЖИВАЯ РАЗМЕР\\\\\n" +
                "o\\7,8+-0,1 ОТ ТОРЦА МАЛОГО ХВОСТОВИКА И ВТОРУЮ КАНАВКУ ШИРИНОЙ 3+0,43 ДО ДИАМЕТРА 10-0,36,ВЫДЕРЖИВАЯ РАЗМЕР\\\\\n" +
                "o\\МЕЖДУ КАНАВКАМИ 42,6-0,2.ШЕРОХОВАТОСТЬ ПОВЕРХНОСТЕЙ ТОРЦЕВ НА ДИАМЕТРЕ 15 ДОЛЖНА БЫТЬ Ra6,3.ШИРИНА КАНАВОК\\\\\n" +
                "o\\1,5+0,43 И 3+0,43 ОБЕСПЕЧИВАЕТСЯ ИНСТРУМЕНТОМ.\\\\\n" +
                "S118                                                                                            01010 0\n" +
                "п\\ПЛАНШАЙБА 71-2188\\  \\\\\n" +
                "п\\ПЛАНШАЙБА 106*П71-15\\  \\\\\n" +
                "п\\ЦЕНТР ПЕРЕДНИЙ 70-618\\  \\\\\n" +
                "п\\ЦЕНТР ЗАДНИЙ 3103*П70-9\\  \\\\\n" +
                "п\\ПАТРОН 25-31\\  \\\\\n" +
                "п\\ТЯГА 56-7575\\  \\\\\n" +
                "п\\ПНЕВМОЦИЛИНДР 160*П24-12\\  \\\\\n" +
                "п\\КУЛАЧОК 57-3613 (3ШТ)\\  \\\\\n" +
                "в\\ДЕРЖАВКА 50-5817\\\\\n" +
                "r\\РЕЗЕЦ 1И-1365\\         \\  \\  \\      \\\\\n" +
                "r\\РЕЗЕЦ 1И-1375\\         \\  \\  \\      \\\\\n" +
                "м\\СКОБА 35Е-881 (ф7-0,36)\\  \\      \\      \\\\\n" +
                "м\\СКОБА 35Е-882 (ф10-0,36)\\  \\      \\      \\\\\n" +
                "м\\СКОБА 35Е-1775 (р-р 42,6-0,2)\\  \\        \\        \\\\\n" +
                "м\\ШТАНГЕНЦИРКУЛЬ ШЦ-I 125-0,1 ГОСТ 166-89\\29\\  0.00\\125.00\\\\\n" +
                "P\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\\\\n" +
                "A\\03180\\015\\  \\4110\\ТОКАРНАЯ                  20141\\ИБ 003-98,ИБ 011-97,ИБ 214-98\\      \\      \\o\\\\\n" +
                "\\ТОКАРНЫЙ МНОГОРЕЗЦОВЫЙ П/А\\15920\\\\\n" +
                "Б\\ \\          \\1А616\\0\\4021 \\0\\04/01 \\1 \\   1\\0 \\     \\ \\   0 \\   0 \\ \\ \\\\\n" +
                "М\\АВТОКАТ Ф78 ТУ 7774-009-27883685-99             \\                            \\   \\    \\    \\      \\       \\\\\n" +
                "O\\  \\015\\0\\O\\01011181 \\ТОЧИТЬ ВЕНЕЦ ДО ДИАМЕТРА 19,5-0,11 НАПРОХОД.ШЕРОХОВАТОСТЬ ПОВЕРХНОСТИ ВЕНЦА ДОЛЖНА БЫТЬ \\\\\n" +
                "й\\Ra6,3.ТОЧИТЬ\\\\\n" +
                "o\\ШЕЙКУ ПОД ВИНТОВУЮ МАСЛООТГОННУЮ КАНАВКУ ДО ДИАМЕТРА 11,4-0,11 НА ДЛИНЕ 46,5 ОТ ТОРЦА ДЕТАЛИ.\\\\\n" +
                "S118                                                                                            01010 0\n" +
                "п\\ПЛАНШАЙБА 71-3132\\  \\\\\n" +
                "п\\ЦЕНТР ПЕРЕДНИЙ 7032-0036 МОРЗЕ 5 ВК8 ГОСТ 13214-79\\  \\\\\n" +
                "п\\ЦЕНТР ЗАДНИЙ 70-591\\  \\\\\n" +
                "п\\ХОМУТИК 57-1516\\  \\\\\n" +
                "п\\ВТУЛКА 6101-0128 4/3 ГОСТ 18258-72\\  \\\\\n" +
                "в\\ДЕРЖАВКА 50-2959\\\\\n" +
                "r\\РЕЗЕЦ 1*Р1-110\\         \\  \\  \\      \\\\\n" +
                "r\\ПЛАСТИНА WNUM-080408 Р30 ГОСТ 19048-80\\ \\  \\  \\      \\\\\n" +
                "r\\РЕЗЕЦ 1И-1534\\         \\  \\  \\      \\\\\n" +
                "м\\СКОБА 35Е-4884 (ф19,5-0,11)\\  \\        \\        \\\\\n" +
                "м\\СКОБА 35Е-3985 (ф11,4-0,11)\\  \\        \\        \\\\\n" +
                "м\\ШТАНГЕНЦИРКУЛЬ ШЦ-I 125-0,1 ГОСТ 166-89\\29\\  0.00\\125.00\\\\\n" +
                "P\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\\\\n";
    }
}
