package ru.profit.teamcenter.import_tp.app.model.repository;

import java.util.Arrays;
import java.util.List;

public class TpContentImpl implements TpContent {
    @Override
    public List<String> getContent(String key) throws Exception {
        String[] content = getContent().split("\n");
        return Arrays.asList(content);
    }

    private String getContent(){
        return  "test\\юРПХАСР1гМЮВЕМХЕ1,юРПХАСР1гМЮВЕМХЕ2,юРПХАСР1гМЮВЕМХЕ3\\юРПХАСР2гМЮВЕМХЕ1,юРПХАСР2гМЮВЕМХЕ2\\юРПХАСР3гМЮВЕМХ1,юРПХАСР3гМЮВЕМХЕ2,юРПХАСР3гМЮВЕМХЕ3\\юРПХАСР4гМЮВ,ЕМХЕ\\\\\n" +
                "т\\пюанвхи (мюкюдвхй) янблеярмн я йнмпнкепнл нрй наъгюм опнбепхрэ оепбсч дерюкэ мю йюфдни тхмхьмни\\\\\n" +
                "т\\ноепюжхх я йюфднцн ярюмйю хглепхрекэмшл хмярпслемрнл он реумнкнцхх\\\\\n" +
                "A\\03180\\005\\  \\4211\\ябепкхкэмн-жемрпнбюкэмюъ  20141\\ха 009-97,ха 214-98\\      \\      \\o\\\\\n" +
                "\\жемрпнбюкэмши дбсуярнпнммхи\\12882 ,\\\\\n" +
                "а\\ \\          \\ую-6000\\0\\4019 \\0\\04/01 \\1 \\   1\\0 \\     \\ \\   0 \\   0 \\ \\ \\\\\n" +
                "л\\юбрнйюр т78 рс 7774-009-27883685-99             \\                            \\   \\    \\    \\      \\       \\\\\n" +
                "O\\  \\005\\a\\O\\9999888  \\жемрпнбюрэ рнпжш гюцнрнбйх я дбсу ярнпнм ндмнбпелеммн б пюглеп ю2 цняр \\\\\n" +
                "И\\14034-74,бшдепфхбюъ пюглеп\\\\\n" +
                "o\\94,326.\\\\\n" +
                "S888                                                                                            99990 0\n" +
                "О\\опхяонянакемхе 24-398\\  \\\\\n" +
                "О\\цсайх 57-3910\\  \\\\\n" +
                "О\\охмжер 250*ь91-400\\  \\\\\n" +
                "Б\\брскйю пецскхпселюъ 51е-5363*б51-12 (2ьр)\\\\\n" +
                "Б\\брскйю Т5*б51-7 (2ьр)\\\\\n" +
                "Б\\оюрпнм 72е-491*11бя-10 (2ьр)\\\\\n" +
                "r\\ябепкн жемрпнбнвмне 2317-0104 цняр 14952-75 (2 ьр)\\ \\  \\  \\      \\\\\n" +
                "Л\\опнайю йнмхвеяйюъ 30е-824\\  \\      \\      \\\\\n" +
                "P\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\\\\n" +
                "A\\03180\\010\\  \\4110\\рнйюпмюъ                  20141\\ха 003-98,ха 011-97\\      \\      \\o\\\\\n" +
                "\\рнйюпмши лмнцнпегжнбши о/ю\\301\\\\\n" +
                "а\\ \\          \\1720\\0\\4021 \\0\\04/01 \\1 \\   1\\0 \\     \\ \\   0 \\   0 \\ \\ \\\\\n" +
                "O\\  \\010\\0\\O\\01011181 \\рнвхрэ ндмнбпелеммн 2 йюмюбйх:оепбсч йюмюбйс ьхпхмни 1,5+0,43 дн дхюлерпю \\\\\n" +
                "И\\7-0,36,бшдепфхбюъ пюглеп\\\\\n" +
                "o\\7,8+-0,1 нр рнпжю люкнцн убнярнбхйю х брнпсч йюмюбйс ьхпхмни 3+0,43 дн дхюлерпю 10-0,36,бшдепфхбюъ пюглеп\\\\\n" +
                "o\\лефдс йюмюбйюлх 42,6-0,2.ьепнунбюрнярэ онбепумняреи рнпжеб мю дхюлерпе 15 днкфмю ашрэ Ra6,3.ьхпхмю йюмюбнй\\\\\n" +
                "o\\1,5+0,43 х 3+0,43 наеяоевхбюеряъ хмярпслемрнл.\\\\\n" +
                "S118                                                                                            01010 0\n" +
                "О\\окюмьюиаю 71-2188\\  \\\\\n" +
                "О\\окюмьюиаю 106*о71-15\\  \\\\\n" +
                "О\\жемрп оепедмхи 70-618\\  \\\\\n" +
                "О\\жемрп гюдмхи 3103*о70-9\\  \\\\\n" +
                "О\\оюрпнм 25-31\\  \\\\\n" +
                "О\\ръцю 56-7575\\  \\\\\n" +
                "О\\омеблнжхкхмдп 160*о24-12\\  \\\\\n" +
                "О\\йскювнй 57-3613 (3ьр)\\  \\\\\n" +
                "Б\\депфюбйю 50-5817\\\\\n" +
                "r\\пегеж 1х-1365\\         \\  \\  \\      \\\\\n" +
                "r\\пегеж 1х-1375\\         \\  \\  \\      \\\\\n" +
                "Л\\яйнаю 35е-881 (Т7-0,36)\\  \\      \\      \\\\\n" +
                "Л\\яйнаю 35е-882 (Т10-0,36)\\  \\      \\      \\\\\n" +
                "Л\\яйнаю 35е-1775 (П-П 42,6-0,2)\\  \\        \\        \\\\\n" +
                "Л\\ьрюмцемжхпйскэ ьж-I 125-0,1 цняр 166-89\\29\\  0.00\\125.00\\\\\n" +
                "P\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\\\\n" +
                "A\\03180\\015\\  \\4110\\рнйюпмюъ                  20141\\ха 003-98,ха 011-97,ха 214-98\\      \\      \\o\\\\\n" +
                "\\рнйюпмши лмнцнпегжнбши о/ю\\15920\\\\\n" +
                "а\\ \\          \\1ю616\\0\\4021 \\0\\04/01 \\1 \\   1\\0 \\     \\ \\   0 \\   0 \\ \\ \\\\\n" +
                "л\\юбрнйюр т78 рс 7774-009-27883685-99             \\                            \\   \\    \\    \\      \\       \\\\\n" +
                "O\\  \\015\\0\\O\\01011181 \\рнвхрэ бемеж дн дхюлерпю 19,5-0,11 мюопнунд.ьепнунбюрнярэ онбепумнярх бемжю днкфмю ашрэ \\\\\n" +
                "И\\Ra6,3.рнвхрэ\\\\\n" +
                "o\\ьеийс онд бхмрнбсч люякннрцнммсч йюмюбйс дн дхюлерпю 11,4-0,11 мю дкхме 46,5 нр рнпжю дерюкх.\\\\\n" +
                "S118                                                                                            01010 0\n" +
                "О\\окюмьюиаю 71-3132\\  \\\\\n" +
                "О\\жемрп оепедмхи 7032-0036 лнпге 5 бй8 цняр 13214-79\\  \\\\\n" +
                "О\\жемрп гюдмхи 70-591\\  \\\\\n" +
                "О\\унлсрхй 57-1516\\  \\\\\n" +
                "О\\брскйю 6101-0128 4/3 цняр 18258-72\\  \\\\\n" +
                "Б\\депфюбйю 50-2959\\\\\n" +
                "r\\пегеж 1*п1-110\\         \\  \\  \\      \\\\\n" +
                "r\\окюярхмю WNUM-080408 п30 цняр 19048-80\\ \\  \\  \\      \\\\\n" +
                "r\\пегеж 1х-1534\\         \\  \\  \\      \\\\\n" +
                "Л\\яйнаю 35е-4884 (Т19,5-0,11)\\  \\        \\        \\\\\n" +
                "Л\\яйнаю 35е-3985 (Т11,4-0,11)\\  \\        \\        \\\\\n" +
                "Л\\ьрюмцемжхпйскэ ьж-I 125-0,1 цняр 166-89\\29\\  0.00\\125.00\\\\\n" +
                "P\\ \\ \\ \\ \\ \\ \\ \\ \\ \\ \\\\\n";
    }
}
